---
kind: method
id: M:Autodesk.Revit.DB.StructuralAsset.Equals(Autodesk.Revit.DB.StructuralAsset)
source: html/65831302-b2e3-3818-8bef-6d0e2a4326f5.htm
---
# Autodesk.Revit.DB.StructuralAsset.Equals Method

Determines whether this structural asset is equal to another.

## Syntax (C#)
```csharp
public bool Equals(
	StructuralAsset other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.StructuralAsset`) - The structural asset with which to compare this structural asset.

## Returns
True if the given structural asset is equal to this one, otherwise false.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null